{"class_name": "Model", "keras_version": "2.0.4", "config": {"name": "model_8", "layers": [{"name": "input_7", "class_name": "InputLayer", "config": {"name": "input_7", "batch_input_shape": [null, 2], "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "dense_19", "class_name": "Dense", "config": {"units": 128, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_19", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "dense_20", "class_name": "Dense", "config": {"units": 12544, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_20", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["dense_19", 0, 0, {}]]]}, {"name": "reshape_7", "class_name": "Reshape", "config": {"name": "reshape_7", "target_shape": [14, 14, 64], "trainable": true}, "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"name": "conv2d_transpose_19", "class_name": "Conv2DTranspose", "config": {"kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_transpose_19", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "filters": 64, "activity_regularizer": null, "activation": "relu", "padding": "same"}, "inbound_nodes": [[["reshape_7", 0, 0, {}]]]}, {"name": "conv2d_transpose_20", "class_name": "Conv2DTranspose", "config": {"kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_transpose_20", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "filters": 64, "activity_regularizer": null, "activation": "relu", "padding": "same"}, "inbound_nodes": [[["conv2d_transpose_19", 0, 0, {}]]]}, {"name": "conv2d_transpose_21", "class_name": "Conv2DTranspose", "config": {"kernel_size": [2, 2], "strides": [2, 2], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_transpose_21", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "filters": 64, "activity_regularizer": null, "activation": "relu", "padding": "valid"}, "inbound_nodes": [[["conv2d_transpose_20", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"kernel_size": [2, 2], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_15", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "filters": 1, "activity_regularizer": null, "activation": "sigmoid", "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv2d_transpose_21", 0, 0, {}]]]}], "output_layers": [["conv2d_15", 0, 0]], "input_layers": [["input_7", 0, 0]]}, "backend": "tensorflow"}