{"config": {"layers": [{"config": {"sparse": false, "name": "input_3", "batch_input_shape": [null, 1], "dtype": "int32"}, "inbound_nodes": [], "name": "input_3", "class_name": "InputLayer"}, {"config": {"embeddings_constraint": null, "name": "embedding_1", "batch_input_shape": [null, null], "embeddings_initializer": {"config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "mask_zero": false, "input_dim": 10, "activity_regularizer": null, "output_dim": 100, "embeddings_regularizer": null, "input_length": null, "trainable": true, "dtype": "int32"}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "embedding_1", "class_name": "Embedding"}, {"config": {"sparse": false, "name": "input_2", "batch_input_shape": [null, 100], "dtype": "float32"}, "inbound_nodes": [], "name": "input_2", "class_name": "InputLayer"}, {"config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "flatten_2", "class_name": "Flatten"}, {"config": {"name": "multiply_1", "trainable": true}, "inbound_nodes": [[["input_2", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "name": "multiply_1", "class_name": "Multiply"}, {"config": [{"config": {"name": "dense_1", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1024, "batch_input_shape": [null, 100], "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "trainable": true, "dtype": "float32", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 6272, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"target_shape": [7, 7, 128], "name": "reshape_1", "trainable": true}, "class_name": "Reshape"}, {"config": {"name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"dilation_rate": [1, 1], "activity_regularizer": null, "name": "conv2d_5", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "strides": [1, 1], "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "filters": 256, "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"config": {"dilation_rate": [1, 1], "activity_regularizer": null, "name": "conv2d_6", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "strides": [1, 1], "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "filters": 128, "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "activity_regularizer": null, "name": "conv2d_7", "kernel_size": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "strides": [1, 1], "activation": "tanh", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "filters": 1, "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}], "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "name": "sequential_2", "class_name": "Sequential"}], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "name": "model_2", "output_layers": [["sequential_2", 1, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.4"}