{"class_name": "Model", "keras_version": "2.0.4", "backend": "tensorflow", "config": {"output_layers": [["loss", 0, 0]], "name": "squeezenet", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 227, 227, 3]}}, {"class_name": "Conv2D", "name": "conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"strides": [2, 2], "filters": 64, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "conv1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "relu_conv1", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"name": "relu_conv1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "pool1", "inbound_nodes": [[["relu_conv1", 0, 0, {}]]], "config": {"padding": "valid", "name": "pool1", "trainable": true, "pool_size": [3, 3], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "fire2/squeeze1x1", "inbound_nodes": [[["pool1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 16, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire2/squeeze1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire2/relu_squeeze1x1", "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "config": {"name": "fire2/relu_squeeze1x1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "fire2/expand1x1", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 64, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire2/expand1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "fire2/expand3x3", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 64, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire2/expand3x3", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire2/relu_expand1x1", "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "config": {"name": "fire2/relu_expand1x1", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "fire2/relu_expand3x3", "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "config": {"name": "fire2/relu_expand3x3", "activation": "relu", "trainable": true}}, {"class_name": "Concatenate", "name": "fire2/concat", "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire2/concat", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "fire3/squeeze1x1", "inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 16, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire3/squeeze1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire3/relu_squeeze1x1", "inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]], "config": {"name": "fire3/relu_squeeze1x1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "fire3/expand1x1", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 64, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire3/expand1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "fire3/expand3x3", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 64, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire3/expand3x3", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire3/relu_expand1x1", "inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]], "config": {"name": "fire3/relu_expand1x1", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "fire3/relu_expand3x3", "inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]], "config": {"name": "fire3/relu_expand3x3", "activation": "relu", "trainable": true}}, {"class_name": "Concatenate", "name": "fire3/concat", "inbound_nodes": [[["fire3/relu_expand1x1", 0, 0, {}], ["fire3/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire3/concat", "trainable": true, "axis": 3}}, {"class_name": "MaxPooling2D", "name": "pool3", "inbound_nodes": [[["fire3/concat", 0, 0, {}]]], "config": {"padding": "valid", "name": "pool3", "trainable": true, "pool_size": [3, 3], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "fire4/squeeze1x1", "inbound_nodes": [[["pool3", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 32, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire4/squeeze1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire4/relu_squeeze1x1", "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]], "config": {"name": "fire4/relu_squeeze1x1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "fire4/expand1x1", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 128, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire4/expand1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "fire4/expand3x3", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 128, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire4/expand3x3", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire4/relu_expand1x1", "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]], "config": {"name": "fire4/relu_expand1x1", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "fire4/relu_expand3x3", "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]], "config": {"name": "fire4/relu_expand3x3", "activation": "relu", "trainable": true}}, {"class_name": "Concatenate", "name": "fire4/concat", "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire4/concat", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "fire5/squeeze1x1", "inbound_nodes": [[["fire4/concat", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 32, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire5/squeeze1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire5/relu_squeeze1x1", "inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]], "config": {"name": "fire5/relu_squeeze1x1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "fire5/expand1x1", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 128, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire5/expand1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "fire5/expand3x3", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 128, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire5/expand3x3", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire5/relu_expand1x1", "inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]], "config": {"name": "fire5/relu_expand1x1", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "fire5/relu_expand3x3", "inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]], "config": {"name": "fire5/relu_expand3x3", "activation": "relu", "trainable": true}}, {"class_name": "Concatenate", "name": "fire5/concat", "inbound_nodes": [[["fire5/relu_expand1x1", 0, 0, {}], ["fire5/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire5/concat", "trainable": true, "axis": 3}}, {"class_name": "MaxPooling2D", "name": "pool5", "inbound_nodes": [[["fire5/concat", 0, 0, {}]]], "config": {"padding": "valid", "name": "pool5", "trainable": true, "pool_size": [3, 3], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "fire6/squeeze1x1", "inbound_nodes": [[["pool5", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 48, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire6/squeeze1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire6/relu_squeeze1x1", "inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]], "config": {"name": "fire6/relu_squeeze1x1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "fire6/expand1x1", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 192, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire6/expand1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "fire6/expand3x3", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 192, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire6/expand3x3", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire6/relu_expand1x1", "inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]], "config": {"name": "fire6/relu_expand1x1", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "fire6/relu_expand3x3", "inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]], "config": {"name": "fire6/relu_expand3x3", "activation": "relu", "trainable": true}}, {"class_name": "Concatenate", "name": "fire6/concat", "inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire6/concat", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "fire7/squeeze1x1", "inbound_nodes": [[["fire6/concat", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 48, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire7/squeeze1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire7/relu_squeeze1x1", "inbound_nodes": [[["fire7/squeeze1x1", 0, 0, {}]]], "config": {"name": "fire7/relu_squeeze1x1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "fire7/expand1x1", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 192, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire7/expand1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "fire7/expand3x3", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 192, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire7/expand3x3", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire7/relu_expand1x1", "inbound_nodes": [[["fire7/expand1x1", 0, 0, {}]]], "config": {"name": "fire7/relu_expand1x1", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "fire7/relu_expand3x3", "inbound_nodes": [[["fire7/expand3x3", 0, 0, {}]]], "config": {"name": "fire7/relu_expand3x3", "activation": "relu", "trainable": true}}, {"class_name": "Concatenate", "name": "fire7/concat", "inbound_nodes": [[["fire7/relu_expand1x1", 0, 0, {}], ["fire7/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire7/concat", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "fire8/squeeze1x1", "inbound_nodes": [[["fire7/concat", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 64, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire8/squeeze1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire8/relu_squeeze1x1", "inbound_nodes": [[["fire8/squeeze1x1", 0, 0, {}]]], "config": {"name": "fire8/relu_squeeze1x1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "fire8/expand1x1", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 256, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire8/expand1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "fire8/expand3x3", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 256, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire8/expand3x3", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire8/relu_expand1x1", "inbound_nodes": [[["fire8/expand1x1", 0, 0, {}]]], "config": {"name": "fire8/relu_expand1x1", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "fire8/relu_expand3x3", "inbound_nodes": [[["fire8/expand3x3", 0, 0, {}]]], "config": {"name": "fire8/relu_expand3x3", "activation": "relu", "trainable": true}}, {"class_name": "Concatenate", "name": "fire8/concat", "inbound_nodes": [[["fire8/relu_expand1x1", 0, 0, {}], ["fire8/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire8/concat", "trainable": true, "axis": 3}}, {"class_name": "Conv2D", "name": "fire9/squeeze1x1", "inbound_nodes": [[["fire8/concat", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 64, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire9/squeeze1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire9/relu_squeeze1x1", "inbound_nodes": [[["fire9/squeeze1x1", 0, 0, {}]]], "config": {"name": "fire9/relu_squeeze1x1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "fire9/expand1x1", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 256, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire9/expand1x1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "fire9/expand3x3", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 256, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fire9/expand3x3", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "fire9/relu_expand1x1", "inbound_nodes": [[["fire9/expand1x1", 0, 0, {}]]], "config": {"name": "fire9/relu_expand1x1", "activation": "relu", "trainable": true}}, {"class_name": "Activation", "name": "fire9/relu_expand3x3", "inbound_nodes": [[["fire9/expand3x3", 0, 0, {}]]], "config": {"name": "fire9/relu_expand3x3", "activation": "relu", "trainable": true}}, {"class_name": "Concatenate", "name": "fire9/concat", "inbound_nodes": [[["fire9/relu_expand1x1", 0, 0, {}], ["fire9/relu_expand3x3", 0, 0, {}]]], "config": {"name": "fire9/concat", "trainable": true, "axis": 3}}, {"class_name": "Dropout", "name": "drop9", "inbound_nodes": [[["fire9/concat", 0, 0, {}]]], "config": {"name": "drop9", "rate": 0.5, "trainable": true}}, {"class_name": "Conv2D", "name": "conv10", "inbound_nodes": [[["drop9", 0, 0, {}]]], "config": {"strides": [1, 1], "filters": 1000, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "conv10", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "relu_conv10", "inbound_nodes": [[["conv10", 0, 0, {}]]], "config": {"name": "relu_conv10", "activation": "relu", "trainable": true}}, {"class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d_1", "inbound_nodes": [[["relu_conv10", 0, 0, {}]]], "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Activation", "name": "loss", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "config": {"name": "loss", "activation": "softmax", "trainable": true}}], "input_layers": [["input_1", 0, 0]]}}